; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v6 ?v1)
             (pred_10 ?v10 ?v3)
             (pred_11 ?v6 ?v3)
             (pred_1 ?v7 ?v6 )
	     (pred_5 ?v6)
             (pred_12 ?v8)
             (pred_4 ?v10)
             (pred_7 ?v3)
             (pred_2 ?v6)
             (pred_8 ?v10)
             (pred_9 ?v6)
             (pred_6 ))



(:action op_5
:parameters (?v11 ?v5 ?v12 ?v4)
:precondition (and (pred_12 ?v11) (pred_12 ?v5) (pred_4 ?v12) (pred_7 ?v4)
          (pred_3 ?v11 ?v5) (pred_10 ?v12 ?v4)
                   (pred_11 ?v5 ?v4) (pred_5 ?v11) 
                   (pred_2 ?v5) (pred_8 ?v12))
:effect (and  (pred_9 ?v5) (not (pred_2 ?v5))))


(:action op_4
:parameters (?v11 ?v13)
:precondition (and (pred_12 ?v11) (pred_12 ?v13)
               (pred_5 ?v11) (pred_3 ?v11 ?v13) (pred_9 ?v13))
:effect (and (pred_5 ?v13) (not (pred_5 ?v11))))

(:action op_2
:parameters (?v11 ?v12)
:precondition (and (pred_12 ?v11) (pred_4 ?v12) 
                  (pred_5 ?v11) (pred_1 ?v12 ?v11) (pred_6 ))
:effect (and (pred_8 ?v12)
   (not (pred_1 ?v12 ?v11)) (not (pred_6 ))))


(:action op_3
:parameters (?v11 ?v9 ?v2)
:precondition (and (pred_12 ?v11) (pred_4 ?v9) (pred_4 ?v2)
                  (pred_5 ?v11) (pred_8 ?v2) (pred_1 ?v9 ?v11))
:effect (and (pred_8 ?v9) (pred_1 ?v2 ?v11)
        (not (pred_8 ?v2)) (not (pred_1 ?v9 ?v11))))

(:action op_1
:parameters (?v11 ?v12)
:precondition (and (pred_12 ?v11) (pred_4 ?v12) 
                  (pred_5 ?v11) (pred_8 ?v12))
:effect (and (pred_6 ) (pred_1 ?v12 ?v11) (not (pred_8 ?v12)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_22 obj_17 obj_02 obj_15 obj_06 obj_08 obj_13 obj_03 obj_10 obj_20 obj_04 obj_14 obj_11 obj_19 obj_01 obj_16
    obj_12 obj_07 obj_09
    obj_18 obj_21 obj_05
    )

    (:init
       (pred_6)

       (pred_12 obj_22)
       (pred_12 obj_17)
       (pred_12 obj_02)
       (pred_12 obj_15)
       (pred_12 obj_06)
       (pred_12 obj_08)
       (pred_12 obj_13)
       (pred_12 obj_03)
       (pred_12 obj_10)
       (pred_12 obj_20)
       (pred_12 obj_04)
       (pred_12 obj_14)
       (pred_12 obj_11)
       (pred_12 obj_19)
       (pred_12 obj_01)
       (pred_12 obj_16)
       (pred_7 obj_12)
       (pred_7 obj_07)
       (pred_7 obj_09)
       (pred_4 obj_18)
       (pred_4 obj_21)
       (pred_4 obj_05)

       (pred_3 obj_22 obj_06)
       (pred_3 obj_22 obj_17)
       (pred_3 obj_17 obj_08)
       (pred_3 obj_17 obj_02)
       (pred_3 obj_17 obj_22)
       (pred_3 obj_02 obj_13)
       (pred_3 obj_02 obj_15)
       (pred_3 obj_02 obj_17)
       (pred_3 obj_15 obj_03)
       (pred_3 obj_15 obj_02)
       (pred_3 obj_06 obj_10)
       (pred_3 obj_06 obj_08)
       (pred_3 obj_06 obj_22)
       (pred_3 obj_08 obj_20)
       (pred_3 obj_08 obj_13)
       (pred_3 obj_08 obj_17)
       (pred_3 obj_08 obj_06)
       (pred_3 obj_13 obj_04)
       (pred_3 obj_13 obj_03)
       (pred_3 obj_13 obj_02)
       (pred_3 obj_13 obj_08)
       (pred_3 obj_03 obj_14)
       (pred_3 obj_03 obj_15)
       (pred_3 obj_03 obj_13)
       (pred_3 obj_10 obj_11)
       (pred_3 obj_10 obj_20)
       (pred_3 obj_10 obj_06)
       (pred_3 obj_20 obj_19)
       (pred_3 obj_20 obj_04)
       (pred_3 obj_20 obj_08)
       (pred_3 obj_20 obj_10)
       (pred_3 obj_04 obj_01)
       (pred_3 obj_04 obj_14)
       (pred_3 obj_04 obj_13)
       (pred_3 obj_04 obj_20)
       (pred_3 obj_14 obj_16)
       (pred_3 obj_14 obj_03)
       (pred_3 obj_14 obj_04)
       (pred_3 obj_11 obj_19)
       (pred_3 obj_11 obj_10)
       (pred_3 obj_19 obj_01)
       (pred_3 obj_19 obj_20)
       (pred_3 obj_19 obj_11)
       (pred_3 obj_01 obj_16)
       (pred_3 obj_01 obj_04)
       (pred_3 obj_01 obj_19)
       (pred_3 obj_16 obj_14)
       (pred_3 obj_16 obj_01)
       (pred_2 obj_20)
       (pred_2 obj_10)
       (pred_2 obj_01)
       (pred_11  obj_20 obj_12)
       (pred_11  obj_10 obj_07)
       (pred_11  obj_01 obj_09)
       (pred_9 obj_22)
       (pred_9 obj_17)
       (pred_9 obj_02)
       (pred_9 obj_15)
       (pred_9 obj_06)
       (pred_9 obj_08)
       (pred_9 obj_13)
       (pred_9 obj_03)
       (pred_9 obj_04)
       (pred_9 obj_14)
       (pred_9 obj_11)
       (pred_9 obj_19)
       (pred_9 obj_16)

       (pred_10  obj_18 obj_12)
       (pred_10  obj_21 obj_07)
       (pred_10  obj_05 obj_09)
       (pred_1 obj_18 obj_16)
       (pred_1 obj_21 obj_22)
       (pred_1 obj_05 obj_17)
       (pred_5 obj_15)
    )

    (:goal (and
       (pred_1 obj_21 obj_17)
    ))
(:constraints
  (always (not (pred_5 obj_02)))
)
)

; plan
1. (op_4 obj_15 obj_03)
   deleted: (pred_5 obj_15)
   added: (pred_5 obj_03)
   goals met: 0 of 1
2. (op_4 obj_03 obj_13)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_13)
   goals met: 0 of 1
3. (op_4 obj_13 obj_08)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_08)
   goals met: 0 of 1
4. (op_4 obj_08 obj_17)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_17)
   goals met: 0 of 1
5. (op_4 obj_17 obj_22)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_22)
   goals met: 0 of 1
6. (op_2 obj_22 obj_21)
   deleted: (pred_1 obj_21 obj_22) (pred_6)
   added: (pred_8 obj_21)
   goals met: 0 of 1
7. (op_4 obj_22 obj_17)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_17)
   goals met: 0 of 1
8. (op_3 obj_17 obj_05 obj_21)
   deleted: (pred_8 obj_21) (pred_1 obj_05 obj_17)
   added: (pred_8 obj_05) (pred_1 obj_21 obj_17)
   goals met: 1 of 1
